OpenFOAM-dev/tutorials/incompressibleFluid/pipeCyclic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            codedFixedValue;
        name            swirl;
        code
        #{
            const vector axis(1, 0, 0);
            vectorField v(2*this->patch().Cf() ^ axis);
            v.replace(vector::X, 1);
            operator==(v);
        #};
        value           $internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
